orderService/artillery.yml
config:
  target: 'http://13.57.211.69:3000'
  phases:
    - duration: 120
      arrivalRate: 10
  processor: './artilleryDataGen.js'
scenarios:
  - name: 'hit get request'
    flow:
      - loop:
        - function: 'generateUser'
        - get:
            url: "/orders/{{user_id}}"
        count: 150
    # - log: 'sent request with {{user_id}}'